{
    "messages": [
        {
           "version": 10,
            "message": "<h1>New Release available 2.0.4</h1><br>There are a number of changes in this release which I hope will improve the overall experience. <br/><ol><li>If you have the Core Rules or Starter set on rolling a Critical Injury for a PC or Synthetic the Critical Injury item will be automatically created and added to the actors sheet. </li><li>Added configuration option to not display the background image on Journal Entries.</li><li>Added configuration option to hide the facehugger background image from chat messages.</li><li>Added option to change the Journal font color.  Please note that some of the font colors are baked into the modules journal settings so will not change.</li><li>Corrected issues with with the setup running for players and First-Time-Setup complete message displaying all the time</li></ol><br>Please read the @JournalEntry[MU/TH/ER Instructions.] to get the most benefit out of using the system and new features."
        },
        {
           "version": 11,
            "message": "<h1>New Release available 2.1.1</h1><br>Changes and fixes in this release which I hope will improve the overall experience. <br/><li>Added Italian translation with thanks to Stefano1975t</li><li>Skill and attribute abbreviation on the Character and Synthetic Skills tab are now localised.</li><li>Agenda, Talent and Specialty items now set a default icon but can be changed as per a normal item..</li><li>Added Critical Injury table dropdown and roll button to the Creature sheets (See Creature section).</li><li>Added a 'Homebrew' selection to the character and synthetic Career dropdowns. </li><li>Increased width of crew position dropdown on the vehicle sheet as it was compressed when using Firefox. </li><li>Rolling Piloting on the vehicle sheet now includes the Manoeuvrability modifier.</li><li>Fixed odd issue with weapons rolls on the vehicle sheet. </li><li>Corrected bug that sets Token Vision on creatures to 'true'.</li><li>Fixed issue with Armor rolls on the Inventory sheet for Synthetics. </li><li>Fixed issue with /em chat background colour.</li><li>Corrected issue with Maestro add-on not working for Vehicle weapons. </li><li>Corrected Radiation rolling issue when using languages other than English.</li><li>Fixed error with weight calculation for armour when in the foot locker. </li><li>Refactored Critical Injury code. </li></ol><br>This will be the last release for Foundry VTT V9 as I need to start working on the V10 upgrade <br><strong>Remember...</strong>  Back up your worlds before upgrading to the new version. <br>Please read the @JournalEntry[MU/TH/ER Instructions.] to get the most benefit out of using the system and new features."
        },
        {
           "version": 12,
            "message": "<h1>New Release available 2.1.2</h1><br>FranzWarm wrote a really great add-on module called CRT UI.  Unfortunately he no longer supports the module so I have incorporated it into the core system.<br>The UI components are now on by default and the sheets can be changed, by the players, selecting the CRT UI button on the 'Configure Alien RPG Settings' menu.<br><strong>Remember...</strong> Back up your worlds before upgrading to the new version. <br>Please read the @JournalEntry[MU/TH/ER Instructions.] to get the most benefit out of using the system and new features."
        }
    ]
}
