{
    "messages": [
        {
           "version": 11,
           "message": "<h1>New Release available 2.1.1</h1><br>Changes and fixes in this release which I hope will improve the overall experience. <br/><li>Added Italian translation with thanks to Stefano1975t</li><li>Skill and attribute abbreviation on the Character and Synthetic Skills tab are now localised.</li><li>Agenda, Talent and Specialty items now set a default icon but can be changed as per a normal item..</li><li>Added Critical Injury table dropdown and roll button to the Creature sheets (See Creature section).</li><li>Added a 'Homebrew' selection to the character and synthetic Career dropdowns. </li><li>Increased width of crew position dropdown on the vehicle sheet as it was compressed when using Firefox. </li><li>Rolling Piloting on the vehicle sheet now includes the Manoeuvrability modifier.</li><li>Fixed odd issue with weapons rolls on the vehicle sheet. </li><li>Corrected bug that sets Token Vision on creatures to 'true'.</li><li>Fixed issue with Armor rolls on the Inventory sheet for Synthetics. </li><li>Fixed issue with /em chat background colour.</li><li>Corrected issue with Maestro add-on not working for Vehicle weapons. </li><li>Corrected Radiation rolling issue when using languages other than English.</li><li>Fixed error with weight calculation for armour when in the foot locker. </li><li>Refactored Critical Injury code. </li></ol><br>This will be the last release for Foundry VTT V9 as I need to start working on the V10 upgrade <br><strong>Remember...</strong>  Back up your worlds before upgrading to the new version. <br>Please read the @JournalEntry[MU/TH/ER Instructions.] to get the most benefit out of using the system and new features."
        },
        {
           "version": 12,
            "message": "<h1>New Release available 2.1.2</h1><br>FranzWarm wrote a really great add-on module called CRT UI.  Unfortunately he no longer supports the module so I have incorporated it into the core system.<br>The UI components are now on by default and the sheets can be changed, by the players, selecting the CRT UI button on the 'Configure Alien RPG Settings' menu.<br><strong>Remember...</strong> Back up your worlds before upgrading to the new version. <br>Please read the @JournalEntry[MU/TH/ER Instructions.] to get the most benefit out of using the system and new features."
        },
               {
           "version": 13,
            "message": "<h1>Alien RPG V10</h1><br />Next week I am going to release Alien RPG for Foundry VTT V10.<br/>As always, take care and be in no hurry to upgrade.  There are only minor fixes in this version - the majority of work has to make it fully compatible with Foundry VTT V10.</p><p>Before you upgrade, remember<strong> make a backup</strong> - see this on how to make a <a href='https://www.youtube.com/watch?v=OmbxMmqNNXU'><b>backup</b></a>.  Once a world has been upgraded to V10, you can not go back.</p><p>The foundry discord have channel #v10-update-troubleshooting to help with upgrades if you run into problems,  but as long as you have a backup, you can always rescue your world.</p>"
        },
               {
           "version": 14,
"message":"<h1>Alien released for v10</h1><p>The Alien system has now gone to v10, with the Free-League modules as well.  PLEASE, make a <a href='https://www.youtube.com/watch?v=OmbxMmqNNXU'>backup</a>, especially if you are going from Foundry v9 to Foundry v10. There are a couple of new features in v10 and some bugs squashed, but the majority of work has been to make it stable and ready for Foundry v10.</p><p>Note that while Alien v9 and the modules works perfectly fine, there are no plans to enhance them further nor provide further bug-fixes for them going forward. </p>I am active in the <a href='https://discord.gg/foundryvtt'>#free-league</a> channel on the Foundry discord.</a>.</p>"
        }
    ]
}
